In [1]:
# Dependencies and Setup
import pandas as pd

# File to Load (Remember to Change These)
school_data_to_load = "Resources/schools_complete.csv"
student_data_to_load = "Resources/students_complete.csv"

In [2]:
import os
cwd = os.getcwd()
cwd

'D:\\Ali\\BootCamp\\Challenge\\Starter_Code-Module_4_Challenge\\Solution\\pandas-challenge\\PyCitySchools'

In [3]:
school_data = pd. read_csv(school_data_to_load,encoding="ISO-8859-1")
school_data.head()

   School ID            school_name      type  size   budget
0          0      Huang High School  District  2917  1910635
1          1   Figueroa High School  District  2949  1884411
2          2    Shelton High School   Charter  1761  1056600
3          3  Hernandez High School  District  4635  3022020
4          4    Griffin High School   Charter  1468   917500

In [4]:
Total_Schools=school_data["school_name"].count()
Total_Schools

15

In [5]:
Total_Bud=school_data["budget"].sum()
Total_Budget="${:,.2f}".format(Total_Bud)
Total_Budget

'$24,649,428.00'

In [6]:
formatcorr=lambda x:"${:,.2f}".format(x)
forstu=lambda x:"{:,}".format(x)
formatcorr(Total_Bud)

'$24,649,428.00'

In [7]:
# Read School and Student Data File and store into Pandas DataFrames
student_data = pd.read_csv(student_data_to_load)
student_data.head()

,Student ID,student_name,gender,grade,school_name,reading_score,math_score
0,0,Paul Bradley,M,9th,Huang High School,66,79
1,1,Victor Smith,M,12th,Huang High School,94,61
2,2,Kevin Rodriguez,M,12th,Huang High School,90,60
3,3,Dr. Richard Scott,M,12th,Huang High School,67,58
4,4,Bonnie Ray,F,9th,Huang High School,97,84

In [52]:
Total_Students=student_data["Student ID"].count()
Total_Students_Format=forstu(Total_Students)
Total_Students

39170

In [27]:
Average_Mass_Score=round(student_data["math_score"].mean(),6)
Average_Mass_Score

78.985371

In [28]:
student_data
Average_Reading_Score

81.87784

In [29]:
Overall_Passing_Reading = student_data.loc[student_data["reading_score"] >= 70, :]
Overall_Passing_Reading

,Student ID,student_name,gender,grade,school_name,reading_score,math_score
1,1,Victor Smith,M,12th,Huang High School,94,61
2,2,Kevin Rodriguez,M,12th,Huang High School,90,60
4,4,Bonnie Ray,F,9th,Huang High School,97,84
5,5,Bryan Miranda,M,9th,Huang High School,94,94
6,6,Sheena Carter,F,11th,Huang High School,82,80
...,...,...,...,...,...,...,...
39165,39165,Donna Howard,F,12th,Thomas High School,99,90
39166,39166,Dawn Bell,F,10th,Thomas High School,95,70
39167,39167,Rebecca Tanner,F,9th,Thomas High School,73,84
39168,39168,Desiree Kidd,F,10th,Thomas High School,99,90
39169,39169,Carolyn Jackson,F,11th,Thomas High School,95,75

In [30]:
Overall_Reading_Score=Overall_Passing_Reading["Student ID"].count()
Overall_Reading_Score

33610

In [32]:
Percent_Overall_Reading_Score=round((Overall_Reading_Score/Total_Students)*100,6)
Percent_Overall_Reading_Score

85.805463

In [33]:
Overall_Passing_Mass = student_data.loc[student_data["math_score"] >= 70, :]
Overall_Passing_Mass

,Student ID,student_name,gender,grade,school_name,reading_score,math_score
0,0,Paul Bradley,M,9th,Huang High School,66,79
4,4,Bonnie Ray,F,9th,Huang High School,97,84
5,5,Bryan Miranda,M,9th,Huang High School,94,94
6,6,Sheena Carter,F,11th,Huang High School,82,80
8,8,Michael Roth,M,10th,Huang High School,95,87
...,...,...,...,...,...,...,...
39165,39165,Donna Howard,F,12th,Thomas High School,99,90
39166,39166,Dawn Bell,F,10th,Thomas High School,95,70
39167,39167,Rebecca Tanner,F,9th,Thomas High School,73,84
39168,39168,Desiree Kidd,F,10th,Thomas High School,99,90
39169,39169,Carolyn Jackson,F,11th,Thomas High School,95,75

In [36]:
Overall_Mass_Score=Overall_Passing_Mass["Student ID"].count()
Overall_Mass_Score

29370

In [37]:
Percent_Overall_Mass_Score=round((Overall_Mass_Score/Total_Students)*100,6)
Percent_Overall_Mass_Score

74.980853

In [46]:
Overall_Passing = student_data.loc[(student_data["math_score"] >= 70) & (
    student_data["reading_score"] >= 70), :]
Overall_Passing

,Student ID,student_name,gender,grade,school_name,reading_score,math_score
4,4,Bonnie Ray,F,9th,Huang High School,97,84
5,5,Bryan Miranda,M,9th,Huang High School,94,94
6,6,Sheena Carter,F,11th,Huang High School,82,80
8,8,Michael Roth,M,10th,Huang High School,95,87
9,9,Matthew Greene,M,10th,Huang High School,96,84
...,...,...,...,...,...,...,...
39165,39165,Donna Howard,F,12th,Thomas High School,99,90
39166,39166,Dawn Bell,F,10th,Thomas High School,95,70
39167,39167,Rebecca Tanner,F,9th,Thomas High School,73,84
39168,39168,Desiree Kidd,F,10th,Thomas High School,99,90
39169,39169,Carolyn Jackson,F,11th,Thomas High School,95,75

In [47]:
Overall_Score=Overall_Passing["Student ID"].count()
Overall_Score

25528

In [48]:
Percent_Overall_Score=round((Overall_Score/Total_Students)*100,6)
Percent_Overall_Score

65.172326

In [53]:
District_Summary=pd.DataFrame({"Total Schools": [Total_Schools], "Total Students": [Total_Students_Format],"Total Budget":[Total_Budget],
                   "Average Mass Score":[Average_Mass_Score],"Average Reading Score":[Average_Reading_Score],"% Passing Mass":[Percent_Overall_Mass_Score],
                              "% Passing Reading":[Percent_Overall_Reading_Score],"% Overall Passing":[Percent_Overall_Score]})
District_Summary

,Total Schools,Total Students,Total Budget,Average Mass Score,Average Reading Score,% Passing Mass,% Passing Reading,% Overall Passing
0,15,"39,170","$24,649,428.00",78.985371,81.87784,74.980853,85.805463,65.172326

In [21]:
# Combine the data into a single dataset.  
school_data_complete = pd.merge(student_data, school_data, how="left", on=["school_name", "school_name"])
school_data_complete

,Student ID,student_name,gender,grade,school_name,reading_score,math_score,School ID,type,size,budget
0,0,Paul Bradley,M,9th,Huang High School,66,79,0,District,2917,1910635
1,1,Victor Smith,M,12th,Huang High School,94,61,0,District,2917,1910635
2,2,Kevin Rodriguez,M,12th,Huang High School,90,60,0,District,2917,1910635
3,3,Dr. Richard Scott,M,12th,Huang High School,67,58,0,District,2917,1910635
4,4,Bonnie Ray,F,9th,Huang High School,97,84,0,District,2917,1910635
...,...,...,...,...,...,...,...,...,...,...,...
39165,39165,Donna Howard,F,12th,Thomas High School,99,90,14,Charter,1635,1043130
39166,39166,Dawn Bell,F,10th,Thomas High School,95,70,14,Charter,1635,1043130
39167,39167,Rebecca Tanner,F,9th,Thomas High School,73,84,14,Charter,1635,1043130
39168,39168,Desiree Kidd,F,10th,Thomas High School,99,90,14,Charter,1635,1043130
39169,39169,Carolyn Jackson,F,11th,Thomas High School,95,75,14,Charter,1635,1043130

In [24]:
# Merge the two DataFrames together based on the Year and State they share

In [ ]:
# Create a DataFrame that filters the data on only 2019

In [ ]:
# Add a new column that calculates the Poverty Rate

In [ ]:
# Sort the data by Poverty Rate and Average Per Capita Income by County, Highest to Lowest

# Reset Index

In [ ]:
# Print out the data for the most poverty stricken state or territory

In [ ]:
# Bonus: Print out the data for the least poverty sticken state or territory with one line of code